{
  "lang": "en",
  "introMarkdown": "\"Progress is the result of hard work and dedication.\" \n\nDuring the period from November 10, 2025, to November 17, 2025, HoverKraft Tech successfully managed two repositories, resulting in three releases. The busiest project was ci-github-common, which accounted for two of the releases, with the most recent version being ci-github-common 0.28.2, released on November 17, 2025. The ci-github-nodejs repository contributed one release.\n\n- ci-github-common achieved a total of 2 releases and 3 stars.\n- ci-github-nodejs had 1 release and 1 star.\n- The focus on ci-github-common highlights its significance in our development efforts.",
  "closingMarkdown": "During the period from November 10, 2025, to November 17, 2025, we focused on two repositories, resulting in three releases. The busiest project was ci-github-common, which had two releases during this timeframe. The most recent release was ci-github-common version 0.28.2.\n\nRepositories to note:\n- ci-github-common (2 releases, 3 ⭐)\n- ci-github-nodejs (1 release, 1 ⭐)\n\nIn conclusion, the week was productive, with significant activity in the ci-github-common repository. Moving forward, we can enhance our efforts by focusing on the following actions:\n\n- Review feedback on the latest releases to identify areas for improvement.\n- Increase collaboration between the ci-github-common and ci-github-nodejs teams to streamline future releases.\n- Plan a marketing strategy to promote the new features in the recent releases.",
  "stats": {
    "period": {
      "since": "2025-11-10T13:06:07.818Z",
      "until": "2025-11-17T13:06:07.818Z"
    },
    "totalRepos": 2,
    "totalReleases": 3,
    "busiestRepo": {
      "name": "ci-github-common",
      "count": 2
    },
    "mostRecentRelease": {
      "repo": "ci-github-common",
      "name": "0.28.2",
      "publishedAt": "2025-11-17T12:46:43Z"
    }
  },
  "repositories": [
    {
      "name": "ci-github-common",
      "description": "Opinionated GitHub actions and workflows for common continuous integration needs",
      "stars": 3,
      "url": "https://github.com/hoverkraft-tech/ci-github-common",
      "releases": [
        {
          "name": "0.28.2",
          "tag": "0.28.2",
          "publishedAt": "2025-11-17T12:46:43Z",
          "url": "https://github.com/hoverkraft-tech/ci-github-common/releases/tag/0.28.2",
          "highlights": [
            "## Release Summary\n\nDocumentation for GitHub Actions and workflows has been refreshed for clarity and up-to-date guidance.\r\n\r\nInternal: dependencies for GitHub Actions were bumped across one directory via Dependabot.\n\n## Breaking change(s)\n\nNo breaking changes."
          ]
        },
        {
          "name": "0.28.1",
          "tag": "0.28.1",
          "publishedAt": "2025-11-12T06:13:56Z",
          "url": "https://github.com/hoverkraft-tech/ci-github-common/releases/tag/0.28.1",
          "highlights": [
            "## Release Summary\n\nPublic: documentation for actions and workflows has been refreshed and clarified.\r\n\r\nInternal: CI checks were re-enabled and permissions tightened, GitHub Actions dependencies were updated.\n\n## Breaking change(s)\n\nThere is no breaking change."
          ]
        }
      ]
    },
    {
      "name": "ci-github-nodejs",
      "description": "Opinionated Github actions and workflows for continuous integration in NodeJs context",
      "stars": 1,
      "url": "https://github.com/hoverkraft-tech/ci-github-nodejs",
      "releases": [
        {
          "name": "0.18.0",
          "tag": "0.18.0",
          "publishedAt": "2025-11-13T09:51:30Z",
          "url": "https://github.com/hoverkraft-tech/ci-github-nodejs/releases/tag/0.18.0",
          "highlights": [
            "## Release Summary\n\nIn **continuous-integration**, artifacts are now addressed by id instead of name and reporting for lint and tests has been upgraded with PR annotations, coverage summaries and streamlined composite actions.\r\nInternal changes: documentation for actions/workflows was updated and dependency groups for GitHub Actions and npm were bumped across multiple directories.\n\n## Breaking change(s)\n\nArtifact selection now requires an **id** rather than a **name** in build steps; update workflows accordingly.\r\nIn \"continuous-integration\" workflow, Lint/test were refactored into composite actions with new defaults (e.g., OIDC for Codecov, auto-detected report formats) and some inputs removed; verify your workflow inputs and coverage settings."
          ]
        }
      ]
    }
  ]
}
